{
  "paths": [
    "Agendas.md",
    "Configuration.md",
    "Patients.md",
    "Profil.md"
  ],
  "contents": [
    {
      "path": "Agendas.md",
      "url": "Agendas.html",
      "content": "# AGENDA\n\n![Menu agenda](images/menu-agenda.png)\n\nPermet au praticien de visualiser ses rendez-vous sur un mois, une semaine ou un jour. Les rendez-vous peuvent avoir été créés à partir de l'agenda ou bien en ligne.\n\n![Visuel des rendez-vous sur l'agenda](images/agenda-calendar.png)\n\nSur cet agenda, il peut y avoir plusieurs plannings et un rendez-vous peut figurer sur plusieurs plannings à la fois.\n\n## Changement de planning \n\n![Changement de planning](images/agenda-plannings.png)\n\n## Impression de l'agenda\n\nCliquer sur l'icône d'impression : \n\n![Impression de l'agenda](images/agenda-impression.png)\n\n## Création d'un nouveau rendez-vous\n\nEn cliquant sur un créneau horaire, une interface de saisie d'information du rendez-vous est ouverte.\n\n![Nouveau rendez-vous](images/agenda-nouveau-rdv.png)\n\n* Le nom et le prénom du patient : voir l'image de la recherche d'un patient\n\n![Recherche d'un patient](images/agenda-recherche-patient.png)\n\n* les plannings sur lesquels ce rendez-vous figurera et les motifs du rendez-vous sur différents plannings\n\n* La couleur du rendez-vous sur l'agenda\n\n* Le statut du rendez-vous : Les valeurs possibles pour ce champ sont **_Statut non renseigné_**, **_Présence à l'heure_**, **_Retard_**, **_Retard important_**, **_RDV annulé dernier moment_** et **_Absence_**\n\n* La date et l'heure du rendez-vous correspondent au créneau sélectionné sur l'agenda mais ces informations peuvent toute fois être modifiées manuellement à partir de cette interface\n\n* La description et le commentaire du rendez-vous\n\n* Dans la rubrique \"**_Plus de détails_**\" on y trouve des informations sur le créateur, la date de création et la date de la dernière modification du rendez-vous. On y trouve aussi les options de rappel du rendez-vous par SMS _si un numéro de téléphone portable est renseigné pour ce patient_.\n\nA la fin de la création d'un rendez-vous, le click sur le bouton \"**OK**\" correspond à l'enregistrement du rendez-vous et ce dernier sera visible sur l'agenda au bon créneau horaire.\n\n## Annulation et suppréssion d'un rendez-vous\n\nCes deux actions sont faites à partir de l'interface de la visualisation du détail d'un rendez-vous. C'est l'interface qui s'ouvre quand on clique sur un rendez-vous dans l'agenda. \n\nLe clique sur le bouton \"**Supprimer**\" ouvrira une fenêtre de dialogue avec trois options : **Retour**, **Marquer annulé** et **Supprimers**.\n\n* **Retour** correspond à l'annulation de l'action\n\n* **Marquer annulé** marquera le rendez-vous comme annulé. Ce rendez-vous ne sera plus visible sur l'agenda mais sera toujours présente dans la base de données et fera partie de la liste des rendez-vous si le praticien veut l'historique des rendez-vous de ce patient\n\n* **Supprimer** : Suppréssion définitive du rendez-vous.\n\n## Mise en attente d'un rendez-vous\n\nSur l'agenda, il faut d'abord faire une recherche d'un patient et une fois le patient sélectionné, appuyer sur l'icône \"**+**\". Le rendez-vous est créé et est mis en attente. Pour pouvoir le placer dans sur un créneau, il faut juste le glisser dessus. \n\n![Liste d'attente](images/agenda-liste-d-attente.png)\n\n* En **_Rouge_** c'est la barre de recherche des patients et en **_Vert_** c'est la liste des patients dont les préfixes de leurs dénominations correspondent à ce qui vient d'être saisi par le praticien\n\n* En **_Bleu_** c'est la liste des rendez-vous qui sont en attente. Il y a aussi deux icônes, l'une c'est pour vider cette liste et l'autre c'est pour ajouter un rendez-vous à cette liste; icône \"**+**\"\n\n* En **_Violet_** nous avons deux icônes qui sont actives dès qu'un patient est sélectionné dans la liste des suggestions : une pour nettoyer la barre de recherche et l'autre pour afficher la liste des rendez-vous du patient sélectionné.\n\n## Liste des rendez-vous d'un patient\n\nPour accéder à la liste des rendez-vous d'un patient ainsi qu'aux autres fonctionnalités telles que :\n\n* la **_Confirmation SMS_** d'un rendez-vous\n\n* l'**_Impression d'une carte de Rendez-vous_**\n\n* l'**_Historique des rendez-vous_** du patient\n\n* la **_Génération manuelle d'un nouveau mot de passe_** pour la prise de rendez-vous en ligne\n\nIl y a deux possibilités à partir de l'agenda : \n\n* Faire une recherche d'un patient dans la barre de recherche et cliquer sur l'icône permettant d'accéder à la liste des rendez-vous de ce patient\n\n* Ouvrir un rendez-vous sur l'agenda et cliquer sur le bouton \"**Tous les rendez-vous**\"",
      "html": "<h1>AGENDA</h1>\n<p><img src=\"images/menu-agenda.png\" alt=\"Menu agenda\"></p>\n<p>Permet au praticien de visualiser ses rendez-vous sur un mois, une semaine ou un jour. Les rendez-vous peuvent avoir été créés à partir de l’agenda ou bien en ligne.</p>\n<p><img src=\"images/agenda-calendar.png\" alt=\"Visuel des rendez-vous sur l'agenda\"></p>\n<p>Sur cet agenda, il peut y avoir plusieurs plannings et un rendez-vous peut figurer sur plusieurs plannings à la fois.</p>\n<h2>Changement de planning</h2>\n<p><img src=\"images/agenda-plannings.png\" alt=\"Changement de planning\"></p>\n<h2>Impression de l’agenda</h2>\n<p>Cliquer sur l’icône d’impression :</p>\n<p><img src=\"images/agenda-impression.png\" alt=\"Impression de l'agenda\"></p>\n<h2>Création d’un nouveau rendez-vous</h2>\n<p>En cliquant sur un créneau horaire, une interface de saisie d’information du rendez-vous est ouverte.</p>\n<p><img src=\"images/agenda-nouveau-rdv.png\" alt=\"Nouveau rendez-vous\"></p>\n<ul>\n<li>Le nom et le prénom du patient : voir l’image de la recherche d’un patient</li>\n</ul>\n<p><img src=\"images/agenda-recherche-patient.png\" alt=\"Recherche d'un patient\"></p>\n<ul>\n<li>\n<p>les plannings sur lesquels ce rendez-vous figurera et les motifs du rendez-vous sur différents plannings</p>\n</li>\n<li>\n<p>La couleur du rendez-vous sur l’agenda</p>\n</li>\n<li>\n<p>Le statut du rendez-vous : Les valeurs possibles pour ce champ sont <strong><em>Statut non renseigné</em></strong>, <strong><em>Présence à l’heure</em></strong>, <strong><em>Retard</em></strong>, <strong><em>Retard important</em></strong>, <strong><em>RDV annulé dernier moment</em></strong> et <strong><em>Absence</em></strong></p>\n</li>\n<li>\n<p>La date et l’heure du rendez-vous correspondent au créneau sélectionné sur l’agenda mais ces informations peuvent toute fois être modifiées manuellement à partir de cette interface</p>\n</li>\n<li>\n<p>La description et le commentaire du rendez-vous</p>\n</li>\n<li>\n<p>Dans la rubrique “<strong><em>Plus de détails</em></strong>” on y trouve des informations sur le créateur, la date de création et la date de la dernière modification du rendez-vous. On y trouve aussi les options de rappel du rendez-vous par SMS <em>si un numéro de téléphone portable est renseigné pour ce patient</em>.</p>\n</li>\n</ul>\n<p>A la fin de la création d’un rendez-vous, le click sur le bouton “<strong>OK</strong>” correspond à l’enregistrement du rendez-vous et ce dernier sera visible sur l’agenda au bon créneau horaire.</p>\n<h2>Annulation et suppréssion d’un rendez-vous</h2>\n<p>Ces deux actions sont faites à partir de l’interface de la visualisation du détail d’un rendez-vous. C’est l’interface qui s’ouvre quand on clique sur un rendez-vous dans l’agenda.</p>\n<p>Le clique sur le bouton “<strong>Supprimer</strong>” ouvrira une fenêtre de dialogue avec trois options : <strong>Retour</strong>, <strong>Marquer annulé</strong> et <strong>Supprimers</strong>.</p>\n<ul>\n<li>\n<p><strong>Retour</strong> correspond à l’annulation de l’action</p>\n</li>\n<li>\n<p><strong>Marquer annulé</strong> marquera le rendez-vous comme annulé. Ce rendez-vous ne sera plus visible sur l’agenda mais sera toujours présente dans la base de données et fera partie de la liste des rendez-vous si le praticien veut l’historique des rendez-vous de ce patient</p>\n</li>\n<li>\n<p><strong>Supprimer</strong> : Suppréssion définitive du rendez-vous.</p>\n</li>\n</ul>\n<h2>Mise en attente d’un rendez-vous</h2>\n<p>Sur l’agenda, il faut d’abord faire une recherche d’un patient et une fois le patient sélectionné, appuyer sur l’icône “<strong>+</strong>”. Le rendez-vous est créé et est mis en attente. Pour pouvoir le placer dans sur un créneau, il faut juste le glisser dessus.</p>\n<p><img src=\"images/agenda-liste-d-attente.png\" alt=\"Liste d'attente\"></p>\n<ul>\n<li>\n<p>En <strong><em>Rouge</em></strong> c’est la barre de recherche des patients et en <strong><em>Vert</em></strong> c’est la liste des patients dont les préfixes de leurs dénominations correspondent à ce qui vient d’être saisi par le praticien</p>\n</li>\n<li>\n<p>En <strong><em>Bleu</em></strong> c’est la liste des rendez-vous qui sont en attente. Il y a aussi deux icônes, l’une c’est pour vider cette liste et l’autre c’est pour ajouter un rendez-vous à cette liste; icône “<strong>+</strong>”</p>\n</li>\n<li>\n<p>En <strong><em>Violet</em></strong> nous avons deux icônes qui sont actives dès qu’un patient est sélectionné dans la liste des suggestions : une pour nettoyer la barre de recherche et l’autre pour afficher la liste des rendez-vous du patient sélectionné.</p>\n</li>\n</ul>\n<h2>Liste des rendez-vous d’un patient</h2>\n<p>Pour accéder à la liste des rendez-vous d’un patient ainsi qu’aux autres fonctionnalités telles que :</p>\n<ul>\n<li>\n<p>la <strong><em>Confirmation SMS</em></strong> d’un rendez-vous</p>\n</li>\n<li>\n<p>l’<strong><em>Impression d’une carte de Rendez-vous</em></strong></p>\n</li>\n<li>\n<p>l’<strong><em>Historique des rendez-vous</em></strong> du patient</p>\n</li>\n<li>\n<p>la <strong><em>Génération manuelle d’un nouveau mot de passe</em></strong> pour la prise de rendez-vous en ligne</p>\n</li>\n</ul>\n<p>Il y a deux possibilités à partir de l’agenda :</p>\n<ul>\n<li>\n<p>Faire une recherche d’un patient dans la barre de recherche et cliquer sur l’icône permettant d’accéder à la liste des rendez-vous de ce patient</p>\n</li>\n<li>\n<p>Ouvrir un rendez-vous sur l’agenda et cliquer sur le bouton “<strong>Tous les rendez-vous</strong>”</p>\n</li>\n</ul>\n",
      "id": 0
    },
    {
      "path": "Configuration.md",
      "url": "Configuration.html",
      "content": "# CONFIGURATION\n\nConfiguration des agendas du praticien : \n\n![Menu configuration](images/menu-configuration.png)\n\nDans cette page, plusieurs options sont disponibles.\n\nTout d’abord, il est possible de définir un nom pour le planning. \nPour cela, il suffit de le saisir dans le champ « Titre » :\n\n![alt text](https://image.noelshack.com/fichiers/2018/15/5/1523621170-capture-d-ecran-2018-04-10-a-16-35-16.png)\n\n\nOn pourra également ajouter une description au Planning ainsi qu'une couleur par défaut pour les rendez-vous.\n\nToute modification effectuée dans le menu de configuration devra être enregistrée via le bouton \"**Sauvegarder**\" en bas de page.\n\n## Utilisateurs et droits d'accès\n\nPermet de définir les propriétaires et l'administrateur du planning sélectionné.\n\nL'administrateur est unique et il ne peut donc y en avoir qu'un.\nC'est lui qui définit quels sont les propriétaires d'un agenda. C'est à dire ceux ayant la possibilité d'accéder au planning et de pouvoir gérer celui-ci.\nL'administrateur peut ajouter autant de propriétaires qu'il le souhaite en passant par le menu de configuration.\nPour ajouter un nouveau propriétaire, il suffit de saisir son nom dans la liste. \nAu cas où il y aurait plusieurs propriétaires, il faudra séparer chaque propriétaire par un espace.\n\n**Exemple** : \n\n![Plusieurs propriétaires](https://image.noelshack.com/fichiers/2018/15/5/1523621730-capture-d-ecran-2018-04-13-a-14-14-36.png)\n\n\nIl est cependant possible de changer d'administrateur à tout moment.\nPour transférer les droits d'administration à un autre utilisateur, il suffit de saisir son nom dans le champ \"Transfert des droits administrateur\" et de cliquer ensuite sur \"Transférer\" ou \"Sauvegarder\" :\n\n![Nouvel administrateur](https://image.noelshack.com/fichiers/2018/15/5/1523621959-capture-d-ecran-2018-04-13-a-14-18-45.png)\n\n\nA partir de là, l'utilisateur indiqué dans \"Transfert des droits administrateur\" verra sur sa page un bouton \"Transférer un planning :\n\n![Transférer un planning](https://image.noelshack.com/fichiers/2018/15/5/1523622193-capture-d-ecran-2018-04-13-a-14-21-49.png)\n\n\n\nIl n'aura donc plus qu'à cliquer sur ce bouton (qui lui demandera ensuite de confirmer ou non la prise de droits) pour devenir le nouvel administrateur :\n\n![Transfer de planning confirmation](https://image.noelshack.com/fichiers/2018/15/5/1523622193-capture-d-ecran-2018-04-13-a-14-22-02.png)\n\n\n\nEnfin, le message suivant apparaitra pour confirmer la réussite du transfert de droits :\n\n![Message de confirmation transfert de planning](https://image.noelshack.com/fichiers/2018/15/5/1523622193-capture-d-ecran-2018-04-13-a-14-22-10.png)\n\n\n\nTant que la personne à qui les droits sont transférés n'a pas confirmer la récupération des droits administrateurs, c'est celui qui a initié le transfert qui restera administrateur. \nCela dans le but d'éviter de perdre les droits administrateur en cas d'erreur dans le nom saisi pour le transfert. \n\n\n\n## Plages horaires d'ouverture\n\nCe menu permet la configuration complète des plages d'ouverture du cabinet.\n\nTrois paramètres sont modifiables, indépendament des journées :\nLa \"Durée par défaut d'un RDV\", qui correspond au temps par défaut pour le créneau d'un nouveau rendez-vous, et la \"Durée minimale d'un RDV\", qui correspond à la durée visible des créneaux horaires dans l'agenda.\nLe troisième paramètre est la couleur, qui sera ainsi la couleur par défaut des rendez-vous.\n\nUne fois ces paramètres saisis, il est possible de configurer les plages horaires d'ouverture soit pour la semaine entière directement, soit journée par journée.\n\nPour la partie semaine :\nà compléter.\n\nPour configurer journée par journée, il suffit de cliquer sur le jour souhaité puis de cliquer sur le bouton \"**+**\", afin de définir les plages horaires souhaitées.\nIl est par exemple possible d'ouvrir le lundi, de 9h à 12h et de 14h à 18h :\n\n![Plages horaires](images/Plages-horaires.png)\n\n\nPour supprimer une plage horaire, il faut simplement cliquer sur le bouton \"**-**\" en bout de ligne.\n\nUne fois toutes les plages configurées, il ne reste plus qu'à tout valider via le bouton \"**Sauvegarder**\" en bas de page.\n\n\n## Evènements récurrents\n\nIl est possible de créer des évenènements récurrents qui apparaitront ensuite dans le planning et qui permettront d'indiquer ce qu'on a prévu de faire à tel jour et tel créneau horaire.\nPour créer un évènement récurrent, il suffit de cliquer sur le bouton \"**+ Ajouter un évènement**\" :\n\n![Evenement recurrents](images/evenement-recurrent.png)\n\nIl faut ensuite donner un nom à l'évènement, lui choisir une couleur et indiquer si cette couleur apparaitra en arrière plan ou non.\nArrière plan signifie que la couleur sera beaucoup plus transparente. Sans l'option arrière plan, la couleur sera de la même intensité que celles des rendez-vous.\n\n**Exemple sans l'option arrière plan** :\n\n![Evenement recurrent arriere plan on](images/evenement-arriere-plan-on.png)\n\n\n**Exemple avec l'option arrière plan** :\n\n![Evenement recurrent arriere plan off](images/evenement-arriere-plan-off.png)\n\nUne fois ces paramètres validés, il faut maintenant indiquer les créneaux horaires concernés par l'évènement.\nLe fonctionnement est le même que pour les plages horaires d'ouverture : on sélectionne une journée, on clique sur le bouton \"**+**\" et on mentionne le créneau horaire souhaité.\n\n**Exemple** : \n\n![alt text](images/exemple-evenement-recurrent.png)\n\nToutefois, il est possible d'indiquer qu'un évnèement s'applique à une journée entière plutôt qu'un créneau horaire.\nPour cela, il faut cocher l'option \"Toute la journée\" :\n\n![Configuration evenement recurrent](images/evenement-journee-config.png)\n\nL'évènement récurrent s'affichera ainsi dans la zone \"Toute la journée\" de l'agenda :\n\n![Evenement recurrent sur l'Agenda](images/evenement-journee-agenda.png)\n\n\n## Prise de rendez-vous\n\nLa gestion des congés, des niveaux d'autorisation pour la prise des rendez-vous ainsi que la gestion des motifs de rendez-vous se fait via ce menu.\nIci, on peut définir le délai maximum, en jours, pour la prise d'un rendez-vous ainsi que le délai de prévenance, en heures, pour leur annulation.\nOn peut également définir le format des noms affichés dans l'agenda, comme **NOM + PRENOM**, **NOM + Prénom**, **Nom + Prénom**, etc. et indiquer la dénomination d'un rendez-vous par défaut pour les patients non identifiés :\n\n![Configuration prise de rendez-vous](images/prise-rdv.png)\n\n\n### Congés\n\nTout d'abord, il est possible d'activer, ou non, l'affichage des jours fériés légaux dans l'agenda.\nSi on souhaite les afficher, il suffit de cocher la case \"Les jours fériés légaux sont pris en compte automatiquement\" :\n\n![Les jours fériés légaux sont pris en compte](images/jours-feries.png)\n\n\nPour obtenir le résultat suivant :\n\n![Jour férié sur l'Agenda](images/exemple-jour-ferie.png)\n\n\nEnsuite, on indique si on souhaite afficher les congés dans l'agenda, la couleur de ceux-ci et enfin les dates concernées.\nLà encore, on clique sur le bouton \"**+**\" pour ajouter une plage de dates, on saisit ensuite les dates et enfin son intitulé :\n\n![Configuration des congés](images/conges-config.png)\n\n\n### Niveaux d'autorisation\n\nLes niveaux d'autorisation, qui vont de 0 à 3, permettent de définir ce qu'un patient ou un correspondant peut faire au niveau du planning.\nPar exemple, si le patient **A** peut prendre des rendez-vous quand il le souhaite, ou bien uniquement pour certains motifs, ou encore certains créneaux horaires uniquement.\nAvant de pouvoir indiquer ce qu'un patient ou un correspondant peut faire, il faut donc commencer par définir ce qu'il est possible de faire selon chaque niveau d'autorisation.\n\nLe \"**Niveau minimum d'autorisation requis pour la prise de RDV en ligne**\" permet de savoir à partir de quel niveau on peut accéder aux rendez-vous en ligne :\n\n![Niveau minimum de prise de rendez-vous](images/niveau-minimum.png)\n\nIl est possible de désactiver cette fonctionnalité en sélectionnant la ligne \"RDV en ligne désactivés (4)\".\n\nLe \"**Niveau maximum accepté pour un RDV en ligne**\" permet cette fois d'indiquer le niveau maximum autorisé (A REVOIR).\n\n![Niveau maximum de prise de rendez-vous](images/niveau-maximum.png)\n\n\nLe \"**Niveau d'autorisation minimum des motifs proposés pour la prise de RDV depuis l'agenda**\" sert à définir à partir de quel niveau on peut sélectionner un motif lors de notre prise de rendez-vous en ligne.\n\n![Niveau motifs](images/niveau-motifs.png)\n\n\nEnfin, les \"**Plages horaires ouvertes par niveau d'autorisation**\" sont à définir de la même manière que les plages horaires classiques.\nIl faut d'abord sélectionner le niveau d'autorisation pour lequel on veut définir les plages, choisir ensuite une journée et cliquer sur le bouton \"**+**\" pour sélectionner le créneau souhaité.\n\nPar exemple, si on veut indiquer que les personnes, dont le niveau d'autorisation est 0, ont le droit de prendre des rendez-vous en ligne le lundi de 8h à 12h, on sélectionne la rubrique \"**Niveau d'autorisation 0**\", on sélectionne le lundi et on ajoute la plage 8h-12h :\n\n![Plage niveau 0](images/plage-niveau0.png)\n\n\n\n### Motifs des rendez-vous\n\nIl est possible de préparer des motifs de rendez-vous afin de ne pas avoir à les saisir manuellement pour chaque rendez-vous futur.\n\nIl faut utiliser le bouton \"**+**\" pour créer un nouveau motif et ensuite, saisir son intitulé, son niveau d'autorisation (pour la prise de rendez-vous en ligne), sa durée par défaut (qui pourra bien entendu être modifiée lors de la prise d'un rendez-vous) et sa couleur :\n\n![Motifs des rendez-vous](images/motif-rdv.png)\n\n\n\n\n## Rappels\n\nCe menu permet au praticien de définir s'il souhaite ou non envoyer des rappels de SMS aux patients.\nPour activer l'option de rappels par SMS, il suffit de cocher la case \"Emettre des rappels par SMS\"\n\n![Illustration rappel SMS 1](images/rappels-rdv-sms-2.png)\n\n\nUne fois l'option activée, il faudra bien veiller à cocher les délais de rappels qui sont tous activés par défaut.\nAinsi, pour activer uniquement un rappel toutes les 48h, il ne faudra cocher que la case \"48h avant le rendez-vous\".\n\n**Exemple** :\n\n![Illustration rappel SMS 2](images/rappels-rdv-48heures.png)\n\n\nIl est ensuite possible de personnaliser les deux types de SMS envoyés aux patients :\n\n1) Le SMS de confirmation initiale. C'est le SMS envoyé au patient lorsqu'il prend rendez-vous en ligne pour qu'il puisse le confirmer :\n\n![Texte de confirmation SMS](images/texte-confirmation-sms.png)\n\n\n2) Le SMS de rappel, celui envoyé 48h, 24h ou 1h (selon le(s) choix effectué(s)) au patient pour lui rappeler son rendez-vous :\n\n![Texte de rappel par SMS](images/texte-rappel-sms.png)\n\nDans ces deux zones de texte, tout ce qui est écrit entre les symboles **{}** sont des champs automatiques.\nPar exemple, le champ **{date-heure}** retourne la date et l'heure du rendez-vous du patient, dans le SMS.\nIl ne faut donc pas modifier ces types de champs.\nTout le reste par contre est modifiable.\n\n\n## Réutilisation des configurations\n\n![Réutilisation des configurations](images/reutilisation-des-configurations.png)\n\n* Le praticien peut **Sauvegarder** la configuration en cours et elle sera enregistré dans un fichier au format **JSON** nommé \"**config-plannings.json**\" et placé dans le dossier des **Téléchargements**.\n\n* Le praticien peut réstaurer une configuration. Il faut **charger une configuration** à partir d'une sauvegarde et tous les plannings seront remplacés par les plannings de ce fichier. Si ce fichier est conforme à la configuration courante, cette restauration préservera les différents états des rendez-vous déjà pris.\n\n## Import export au format iCalendar (.ics)\n\nA venir",
      "html": "<h1>CONFIGURATION</h1>\n<p>Configuration des agendas du praticien :</p>\n<p><img src=\"images/menu-configuration.png\" alt=\"Menu configuration\"></p>\n<p>Dans cette page, plusieurs options sont disponibles.</p>\n<p>Tout d’abord, il est possible de définir un nom pour le planning.\nPour cela, il suffit de le saisir dans le champ « Titre » :</p>\n<p><img src=\"https://image.noelshack.com/fichiers/2018/15/5/1523621170-capture-d-ecran-2018-04-10-a-16-35-16.png\" alt=\"alt text\"></p>\n<p>On pourra également ajouter une description au Planning ainsi qu’une couleur par défaut pour les rendez-vous.</p>\n<p>Toute modification effectuée dans le menu de configuration devra être enregistrée via le bouton “<strong>Sauvegarder</strong>” en bas de page.</p>\n<h2>Utilisateurs et droits d’accès</h2>\n<p>Permet de définir les propriétaires et l’administrateur du planning sélectionné.</p>\n<p>L’administrateur est unique et il ne peut donc y en avoir qu’un.\nC’est lui qui définit quels sont les propriétaires d’un agenda. C’est à dire ceux ayant la possibilité d’accéder au planning et de pouvoir gérer celui-ci.\nL’administrateur peut ajouter autant de propriétaires qu’il le souhaite en passant par le menu de configuration.\nPour ajouter un nouveau propriétaire, il suffit de saisir son nom dans la liste.\nAu cas où il y aurait plusieurs propriétaires, il faudra séparer chaque propriétaire par un espace.</p>\n<p><strong>Exemple</strong> :</p>\n<p><img src=\"https://image.noelshack.com/fichiers/2018/15/5/1523621730-capture-d-ecran-2018-04-13-a-14-14-36.png\" alt=\"Plusieurs propriétaires\"></p>\n<p>Il est cependant possible de changer d’administrateur à tout moment.\nPour transférer les droits d’administration à un autre utilisateur, il suffit de saisir son nom dans le champ “Transfert des droits administrateur” et de cliquer ensuite sur “Transférer” ou “Sauvegarder” :</p>\n<p><img src=\"https://image.noelshack.com/fichiers/2018/15/5/1523621959-capture-d-ecran-2018-04-13-a-14-18-45.png\" alt=\"Nouvel administrateur\"></p>\n<p>A partir de là, l’utilisateur indiqué dans “Transfert des droits administrateur” verra sur sa page un bouton &quot;Transférer un planning :</p>\n<p><img src=\"https://image.noelshack.com/fichiers/2018/15/5/1523622193-capture-d-ecran-2018-04-13-a-14-21-49.png\" alt=\"Transférer un planning\"></p>\n<p>Il n’aura donc plus qu’à cliquer sur ce bouton (qui lui demandera ensuite de confirmer ou non la prise de droits) pour devenir le nouvel administrateur :</p>\n<p><img src=\"https://image.noelshack.com/fichiers/2018/15/5/1523622193-capture-d-ecran-2018-04-13-a-14-22-02.png\" alt=\"Transfer de planning confirmation\"></p>\n<p>Enfin, le message suivant apparaitra pour confirmer la réussite du transfert de droits :</p>\n<p><img src=\"https://image.noelshack.com/fichiers/2018/15/5/1523622193-capture-d-ecran-2018-04-13-a-14-22-10.png\" alt=\"Message de confirmation transfert de planning\"></p>\n<p>Tant que la personne à qui les droits sont transférés n’a pas confirmer la récupération des droits administrateurs, c’est celui qui a initié le transfert qui restera administrateur.\nCela dans le but d’éviter de perdre les droits administrateur en cas d’erreur dans le nom saisi pour le transfert.</p>\n<h2>Plages horaires d’ouverture</h2>\n<p>Ce menu permet la configuration complète des plages d’ouverture du cabinet.</p>\n<p>Trois paramètres sont modifiables, indépendament des journées :\nLa “Durée par défaut d’un RDV”, qui correspond au temps par défaut pour le créneau d’un nouveau rendez-vous, et la “Durée minimale d’un RDV”, qui correspond à la durée visible des créneaux horaires dans l’agenda.\nLe troisième paramètre est la couleur, qui sera ainsi la couleur par défaut des rendez-vous.</p>\n<p>Une fois ces paramètres saisis, il est possible de configurer les plages horaires d’ouverture soit pour la semaine entière directement, soit journée par journée.</p>\n<p>Pour la partie semaine :\nà compléter.</p>\n<p>Pour configurer journée par journée, il suffit de cliquer sur le jour souhaité puis de cliquer sur le bouton “<strong>+</strong>”, afin de définir les plages horaires souhaitées.\nIl est par exemple possible d’ouvrir le lundi, de 9h à 12h et de 14h à 18h :</p>\n<p><img src=\"images/Plages-horaires.png\" alt=\"Plages horaires\"></p>\n<p>Pour supprimer une plage horaire, il faut simplement cliquer sur le bouton “<strong>-</strong>” en bout de ligne.</p>\n<p>Une fois toutes les plages configurées, il ne reste plus qu’à tout valider via le bouton “<strong>Sauvegarder</strong>” en bas de page.</p>\n<h2>Evènements récurrents</h2>\n<p>Il est possible de créer des évenènements récurrents qui apparaitront ensuite dans le planning et qui permettront d’indiquer ce qu’on a prévu de faire à tel jour et tel créneau horaire.\nPour créer un évènement récurrent, il suffit de cliquer sur le bouton “<strong>+ Ajouter un évènement</strong>” :</p>\n<p><img src=\"images/evenement-recurrent.png\" alt=\"Evenement recurrents\"></p>\n<p>Il faut ensuite donner un nom à l’évènement, lui choisir une couleur et indiquer si cette couleur apparaitra en arrière plan ou non.\nArrière plan signifie que la couleur sera beaucoup plus transparente. Sans l’option arrière plan, la couleur sera de la même intensité que celles des rendez-vous.</p>\n<p><strong>Exemple sans l’option arrière plan</strong> :</p>\n<p><img src=\"images/evenement-arriere-plan-on.png\" alt=\"Evenement recurrent arriere plan on\"></p>\n<p><strong>Exemple avec l’option arrière plan</strong> :</p>\n<p><img src=\"images/evenement-arriere-plan-off.png\" alt=\"Evenement recurrent arriere plan off\"></p>\n<p>Une fois ces paramètres validés, il faut maintenant indiquer les créneaux horaires concernés par l’évènement.\nLe fonctionnement est le même que pour les plages horaires d’ouverture : on sélectionne une journée, on clique sur le bouton “<strong>+</strong>” et on mentionne le créneau horaire souhaité.</p>\n<p><strong>Exemple</strong> :</p>\n<p><img src=\"images/exemple-evenement-recurrent.png\" alt=\"alt text\"></p>\n<p>Toutefois, il est possible d’indiquer qu’un évnèement s’applique à une journée entière plutôt qu’un créneau horaire.\nPour cela, il faut cocher l’option “Toute la journée” :</p>\n<p><img src=\"images/evenement-journee-config.png\" alt=\"Configuration evenement recurrent\"></p>\n<p>L’évènement récurrent s’affichera ainsi dans la zone “Toute la journée” de l’agenda :</p>\n<p><img src=\"images/evenement-journee-agenda.png\" alt=\"Evenement recurrent sur l'Agenda\"></p>\n<h2>Prise de rendez-vous</h2>\n<p>La gestion des congés, des niveaux d’autorisation pour la prise des rendez-vous ainsi que la gestion des motifs de rendez-vous se fait via ce menu.\nIci, on peut définir le délai maximum, en jours, pour la prise d’un rendez-vous ainsi que le délai de prévenance, en heures, pour leur annulation.\nOn peut également définir le format des noms affichés dans l’agenda, comme <strong>NOM + PRENOM</strong>, <strong>NOM + Prénom</strong>, <strong>Nom + Prénom</strong>, etc. et indiquer la dénomination d’un rendez-vous par défaut pour les patients non identifiés :</p>\n<p><img src=\"images/prise-rdv.png\" alt=\"Configuration prise de rendez-vous\"></p>\n<h3>Congés</h3>\n<p>Tout d’abord, il est possible d’activer, ou non, l’affichage des jours fériés légaux dans l’agenda.\nSi on souhaite les afficher, il suffit de cocher la case “Les jours fériés légaux sont pris en compte automatiquement” :</p>\n<p><img src=\"images/jours-feries.png\" alt=\"Les jours fériés légaux sont pris en compte\"></p>\n<p>Pour obtenir le résultat suivant :</p>\n<p><img src=\"images/exemple-jour-ferie.png\" alt=\"Jour férié sur l'Agenda\"></p>\n<p>Ensuite, on indique si on souhaite afficher les congés dans l’agenda, la couleur de ceux-ci et enfin les dates concernées.\nLà encore, on clique sur le bouton “<strong>+</strong>” pour ajouter une plage de dates, on saisit ensuite les dates et enfin son intitulé :</p>\n<p><img src=\"images/conges-config.png\" alt=\"Configuration des congés\"></p>\n<h3>Niveaux d’autorisation</h3>\n<p>Les niveaux d’autorisation, qui vont de 0 à 3, permettent de définir ce qu’un patient ou un correspondant peut faire au niveau du planning.\nPar exemple, si le patient <strong>A</strong> peut prendre des rendez-vous quand il le souhaite, ou bien uniquement pour certains motifs, ou encore certains créneaux horaires uniquement.\nAvant de pouvoir indiquer ce qu’un patient ou un correspondant peut faire, il faut donc commencer par définir ce qu’il est possible de faire selon chaque niveau d’autorisation.</p>\n<p>Le “<strong>Niveau minimum d’autorisation requis pour la prise de RDV en ligne</strong>” permet de savoir à partir de quel niveau on peut accéder aux rendez-vous en ligne :</p>\n<p><img src=\"images/niveau-minimum.png\" alt=\"Niveau minimum de prise de rendez-vous\"></p>\n<p>Il est possible de désactiver cette fonctionnalité en sélectionnant la ligne “RDV en ligne désactivés (4)”.</p>\n<p>Le “<strong>Niveau maximum accepté pour un RDV en ligne</strong>” permet cette fois d’indiquer le niveau maximum autorisé (A REVOIR).</p>\n<p><img src=\"images/niveau-maximum.png\" alt=\"Niveau maximum de prise de rendez-vous\"></p>\n<p>Le “<strong>Niveau d’autorisation minimum des motifs proposés pour la prise de RDV depuis l’agenda</strong>” sert à définir à partir de quel niveau on peut sélectionner un motif lors de notre prise de rendez-vous en ligne.</p>\n<p><img src=\"images/niveau-motifs.png\" alt=\"Niveau motifs\"></p>\n<p>Enfin, les “<strong>Plages horaires ouvertes par niveau d’autorisation</strong>” sont à définir de la même manière que les plages horaires classiques.\nIl faut d’abord sélectionner le niveau d’autorisation pour lequel on veut définir les plages, choisir ensuite une journée et cliquer sur le bouton “<strong>+</strong>” pour sélectionner le créneau souhaité.</p>\n<p>Par exemple, si on veut indiquer que les personnes, dont le niveau d’autorisation est 0, ont le droit de prendre des rendez-vous en ligne le lundi de 8h à 12h, on sélectionne la rubrique “<strong>Niveau d’autorisation 0</strong>”, on sélectionne le lundi et on ajoute la plage 8h-12h :</p>\n<p><img src=\"images/plage-niveau0.png\" alt=\"Plage niveau 0\"></p>\n<h3>Motifs des rendez-vous</h3>\n<p>Il est possible de préparer des motifs de rendez-vous afin de ne pas avoir à les saisir manuellement pour chaque rendez-vous futur.</p>\n<p>Il faut utiliser le bouton “<strong>+</strong>” pour créer un nouveau motif et ensuite, saisir son intitulé, son niveau d’autorisation (pour la prise de rendez-vous en ligne), sa durée par défaut (qui pourra bien entendu être modifiée lors de la prise d’un rendez-vous) et sa couleur :</p>\n<p><img src=\"images/motif-rdv.png\" alt=\"Motifs des rendez-vous\"></p>\n<h2>Rappels</h2>\n<p>Ce menu permet au praticien de définir s’il souhaite ou non envoyer des rappels de SMS aux patients.\nPour activer l’option de rappels par SMS, il suffit de cocher la case “Emettre des rappels par SMS”</p>\n<p><img src=\"images/rappels-rdv-sms-2.png\" alt=\"Illustration rappel SMS 1\"></p>\n<p>Une fois l’option activée, il faudra bien veiller à cocher les délais de rappels qui sont tous activés par défaut.\nAinsi, pour activer uniquement un rappel toutes les 48h, il ne faudra cocher que la case “48h avant le rendez-vous”.</p>\n<p><strong>Exemple</strong> :</p>\n<p><img src=\"images/rappels-rdv-48heures.png\" alt=\"Illustration rappel SMS 2\"></p>\n<p>Il est ensuite possible de personnaliser les deux types de SMS envoyés aux patients :</p>\n<ol>\n<li>Le SMS de confirmation initiale. C’est le SMS envoyé au patient lorsqu’il prend rendez-vous en ligne pour qu’il puisse le confirmer :</li>\n</ol>\n<p><img src=\"images/texte-confirmation-sms.png\" alt=\"Texte de confirmation SMS\"></p>\n<ol start=\"2\">\n<li>Le SMS de rappel, celui envoyé 48h, 24h ou 1h (selon le(s) choix effectué(s)) au patient pour lui rappeler son rendez-vous :</li>\n</ol>\n<p><img src=\"images/texte-rappel-sms.png\" alt=\"Texte de rappel par SMS\"></p>\n<p>Dans ces deux zones de texte, tout ce qui est écrit entre les symboles <strong>{}</strong> sont des champs automatiques.\nPar exemple, le champ <strong>{date-heure}</strong> retourne la date et l’heure du rendez-vous du patient, dans le SMS.\nIl ne faut donc pas modifier ces types de champs.\nTout le reste par contre est modifiable.</p>\n<h2>Réutilisation des configurations</h2>\n<p><img src=\"images/reutilisation-des-configurations.png\" alt=\"Réutilisation des configurations\"></p>\n<ul>\n<li>\n<p>Le praticien peut <strong>Sauvegarder</strong> la configuration en cours et elle sera enregistré dans un fichier au format <strong>JSON</strong> nommé “<strong>config-plannings.json</strong>” et placé dans le dossier des <strong>Téléchargements</strong>.</p>\n</li>\n<li>\n<p>Le praticien peut réstaurer une configuration. Il faut <strong>charger une configuration</strong> à partir d’une sauvegarde et tous les plannings seront remplacés par les plannings de ce fichier. Si ce fichier est conforme à la configuration courante, cette restauration préservera les différents états des rendez-vous déjà pris.</p>\n</li>\n</ul>\n<h2>Import export au format iCalendar (.ics)</h2>\n<p>A venir</p>\n",
      "id": 1
    },
    {
      "path": "Patients.md",
      "url": "Patients.html",
      "content": "# PATIENTS\n\nLe praticien accède aux fiches de ses patients.\n\n![Menu patients](images/menu-patients.png)\n\nPermet de créer, lire, mettre à jour ou supprimer une fiche d'un patient.\n\nCréation d'une nouvelle fiche : \n\n![Menu patients](images/nouveau-patient.png)\n\n* Sur une fiche, les informations générales se trouvent dans la rubrique **Informations générales**. On y retrouve aussi l'identifiant du patient dans la base de données (préfixé par un \"**_#_**\").\n\n* Les coordonnées du patient sont dans la rubrique **Adresse et contact**. Il faut noter qu'un numéro de téléphone portable du patient est nécessaire que le praticien puisse faire un rappel de rendez-vous par SMS.\n\n## Gestion des rendez-vous\n\nDans cette rubrique, le praticien pourra affecter au patient un niveau d'autorisation pour la prise de rendez-vous en ligne, autoriser/bloquer les rappels de rendez-vous par SMS et acceder aux autres services.\n\n![Gestion des rendez-vous d'un patient](images/gestion-rdv-patients.png)\n\nLe praticien accédera aux autres services via le bouton \"**Rendez-vous**\".\n\n* Confirmation de Rendez-vous par SMS\n* Impression de la liste des prochains rendez-vous sur une carte\n* Historique des rendez-vous du patient\n* Génération d'un nouveau mot de passe pour le patient\n\nUne aide pour l'impression d'une carte de rendez-vous est fournie pour les navigateurs **_Google Chrome_**, **_Mozilla Firefox_**, **_Microsoft Edge_** et **_Safari_**. \n\nOptions d'impréssion de l'historique des rendez-vous : \n\n![Historique des rendez-vous d'un patient](images/historique-rdv.png)",
      "html": "<h1>PATIENTS</h1>\n<p>Le praticien accède aux fiches de ses patients.</p>\n<p><img src=\"images/menu-patients.png\" alt=\"Menu patients\"></p>\n<p>Permet de créer, lire, mettre à jour ou supprimer une fiche d’un patient.</p>\n<p>Création d’une nouvelle fiche :</p>\n<p><img src=\"images/nouveau-patient.png\" alt=\"Menu patients\"></p>\n<ul>\n<li>\n<p>Sur une fiche, les informations générales se trouvent dans la rubrique <strong>Informations générales</strong>. On y retrouve aussi l’identifiant du patient dans la base de données (préfixé par un “<strong><em>#</em></strong>”).</p>\n</li>\n<li>\n<p>Les coordonnées du patient sont dans la rubrique <strong>Adresse et contact</strong>. Il faut noter qu’un numéro de téléphone portable du patient est nécessaire que le praticien puisse faire un rappel de rendez-vous par SMS.</p>\n</li>\n</ul>\n<h2>Gestion des rendez-vous</h2>\n<p>Dans cette rubrique, le praticien pourra affecter au patient un niveau d’autorisation pour la prise de rendez-vous en ligne, autoriser/bloquer les rappels de rendez-vous par SMS et acceder aux autres services.</p>\n<p><img src=\"images/gestion-rdv-patients.png\" alt=\"Gestion des rendez-vous d'un patient\"></p>\n<p>Le praticien accédera aux autres services via le bouton “<strong>Rendez-vous</strong>”.</p>\n<ul>\n<li>Confirmation de Rendez-vous par SMS</li>\n<li>Impression de la liste des prochains rendez-vous sur une carte</li>\n<li>Historique des rendez-vous du patient</li>\n<li>Génération d’un nouveau mot de passe pour le patient</li>\n</ul>\n<p>Une aide pour l’impression d’une carte de rendez-vous est fournie pour les navigateurs <strong><em>Google Chrome</em></strong>, <strong><em>Mozilla Firefox</em></strong>, <strong><em>Microsoft Edge</em></strong> et <strong><em>Safari</em></strong>.</p>\n<p>Options d’impréssion de l’historique des rendez-vous :</p>\n<p><img src=\"images/historique-rdv.png\" alt=\"Historique des rendez-vous d'un patient\"></p>\n",
      "id": 2
    },
    {
      "path": "Profil.md",
      "url": "Profil.html",
      "content": "# PROFIL\n\n![Menu profil](images/menu-profil.png)\n\nPermet au praticien de saisir toutes ses coordonnées administratives et de changer son mot de passe s'il le souhaite.\n\n![Information profil praticien](images/profil-praticien.png)\n\nPour modifier le mot de passe, il suffit de cocher la case \"Changer le mot de passe\", choisir un nouveau mot de passe puis, le confirmer.\nCliquer ensuite sur \"Sauvegarder\", en bas de page, pour valider le changement.\n\nLe praticien peut aussi y consulter son **historique des sms**.\n\n![Menu profil historique SMS](images/menu-profil-sms-history-btn.png)",
      "html": "<h1>PROFIL</h1>\n<p><img src=\"images/menu-profil.png\" alt=\"Menu profil\"></p>\n<p>Permet au praticien de saisir toutes ses coordonnées administratives et de changer son mot de passe s’il le souhaite.</p>\n<p><img src=\"images/profil-praticien.png\" alt=\"Information profil praticien\"></p>\n<p>Pour modifier le mot de passe, il suffit de cocher la case “Changer le mot de passe”, choisir un nouveau mot de passe puis, le confirmer.\nCliquer ensuite sur “Sauvegarder”, en bas de page, pour valider le changement.</p>\n<p>Le praticien peut aussi y consulter son <strong>historique des sms</strong>.</p>\n<p><img src=\"images/menu-profil-sms-history-btn.png\" alt=\"Menu profil historique SMS\"></p>\n",
      "id": 3
    }
  ]
}